app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ofarrellmeister@gmail.com"], ["LIMIT", 1]]