app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = Card.all

INSERT INTO "cards" ("prompt", "answer", "is_public", "deck_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["prompt", "test"], ["answer", "again"], ["is_public", false], ["deck_id", 1], ["created_at", "2019-10-09 13:53:01.507475"], ["updated_at", "2019-10-09 13:53:01.507475"], ["user_id", 1]]
---
  def create
    @card = Card.new(card_params)
    if @card.save

UPDATE "cards" SET "prompt" = $1, "answer" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["prompt", "test"], ["answer", "tet"], ["updated_at", "2019-10-09 14:08:14.412500"], ["id", 49]]
---
  def update
    if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 2]]
---
  def destroy
    @card.destroy

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_card
      @card = Card.find(params[:id])