app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks"
---
  def index
    @decks = Deck.all #.with_faves

SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_deck
      @deck = Deck.find(params[:id])