app/controllers/faves_controller.rb

  def create
    @fave = Fave.new({
      user: @current_user,
      deck: @deck
    })

    if @fave.save
---
INSERT INTO "faves" ("user_id", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["deck_id", 6], ["created_at", "2019-10-07 21:02:11.675276"], ["updated_at", "2019-10-07 21:02:11.675276"]]

    def set_deck
      @deck = Deck.find(params[:deck_id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def set_fave
      puts @current_user
      @fave = Fave.where(user_id: @current_user.id, deck_id: params[:deck_id])
---
SELECT "faves".* FROM "faves" WHERE "faves"."user_id" = $1  [["user_id", 1]]