app/models/user.rb

SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def get_faves
    {
      id: id,
      first_name: first_name,
      last_name: last_name,
      email: email,
      faves: faves.map { |fave| fave.deck }