decoding_code/app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT "cards".* FROM "cards"

    def set_card
      @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]