decoding_code/app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks"
---
  def index
    @decks = Deck.all

SELECT "cards".* FROM "cards" WHERE (deck_id = undefined)
---
  def card_by_deck
    @cards = Card.where("deck_id = #{params[:id]}")

SELECT "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_deck
      @deck = Deck.find(params[:id])