decoding_code/app/controllers/faves_controller.rb

SELECT "faves".* FROM "faves"
---
  def index
    @faves = Fave.all

INSERT INTO "faves" ("user_id", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["deck_id", 1], ["created_at", "2019-10-05 16:16:00.017185"], ["updated_at", "2019-10-05 16:16:00.017185"]]
---
  def create
    @fave = Fave.new(fave_params)

    if @fave.save