decoding_code/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "Ress Barrow"], ["updated_at", "2019-10-05 15:59:45.346448"], ["id", 1]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])